src/cfe/КСП/Documents/КСП_АктПриемкиПоКачеству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_АктПриемкиПоКачеству</Name>
			<BasedOn>
				<xr:Item>Document.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПаспортКачества</xr:Item>
				<xr:Item>InformationRegister.КСП_РезультатыПриемкиПряжиПоКачеству</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиматическиеУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереченьНормативнойДокументации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребованияПроизводственногоОтдела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеСТК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЛотам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДляТестовогоОтвяза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБрака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольКачества</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норматив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеНедостатков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеВыявленныхНедостатковПродукции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/КСП_РезультатыПриемкиПряжиПоКачеству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>КСП_РезультатыПриемкиПряжиПоКачеству</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Норматив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеВыявленныхНедостатковПродукции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПунктПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_АктПриемкиПоКачеству/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	РегламентированнаяОтчетность.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
КонецПроцедуры

Функция ПроверкаЗавершенияКонтроляКачестваТестовыхОтвязов(ЧекЛистПроверкиКачестваТестовыхОтвязов)
	ПроверкаКачестваТестовыхОтвязовЗавершена = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.НомерСтроки,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Номенклатура,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Характеристика
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов.Товары КАК ЧекЛистПроверкиКачестваТестовыхОтвязовТовары
		|ГДЕ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.Ссылка = &ЧекЛистПроверкиКачестваТестовыхОтвязов
		|	И ЧекЛистПроверкиКачестваТестовыхОтвязовТовары.ПроверкаЗавершена = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ЧекЛистПроверкиКачестваТестовыхОтвязов", ЧекЛистПроверкиКачестваТестовыхОтвязов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПроверкаКачестваТестовыхОтвязовЗавершена = Ложь;
		Сообщить("В документе основании по номенклатуре " + ВыборкаДетальныеЗаписи.Номенклатура + " " + ВыборкаДетальныеЗаписи.Характеристика + " в строке " + ВыборкаДетальныеЗаписи.НомерСтроки + " не был выполнен контроль качества.", СтатусСообщения.Внимание);
	КонецЦикла;
	
	Если Не ПроверкаКачестваТестовыхОтвязовЗавершена Тогда
		Сообщить("Ввод на основании невозможен. Сначала завершите контроль качества!", СтатусСообщения.Важное);
	КонецЕсли;
	
	Возврат ПроверкаКачестваТестовыхОтвязовЗавершена;
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов") Тогда    		
		Если Не ПроверкаЗавершенияКонтроляКачестваТестовыхОтвязов(ДанныеЗаполнения) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		// Заполнение шапки
		ПереченьНормативнойДокументации = "ГОСТ 6611.0-73 (СТ СЭВ 2462-80) Нити текстильные. Правила приемки (с Изменениями №1, 2, 3, 4)";
		КлиматическиеУсловия = "Относительная влажность воздуха - (65+-2)%, температура воздуха - (20+-2) С";
		Комментарий = " Введен на основании " + ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Для Каждого ТекСтрокаКонтрольКачества Из ДанныеЗаполнения.КонтрольКачества Цикл
			НоваяСтрока = КонтрольКачества.Добавить();
			НоваяСтрока.КлючСтроки = ТекСтрокаКонтрольКачества.КлючСтроки;
			НоваяСтрока.Норматив = ТекСтрокаКонтрольКачества.Норматив;
			НоваяСтрока.Отклонение = ТекСтрокаКонтрольКачества.Отклонение;
			НоваяСтрока.ПунктПроверки = ТекСтрокаКонтрольКачества.ПунктПроверки;
			НоваяСтрока.Факт = ТекСтрокаКонтрольКачества.Факт;
		КонецЦикла;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.КлючСтроки = ТекСтрокаТовары.КлючСтроки;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.КоличествоБрака = ТекСтрокаТовары.КоличествоБрака;
			НоваяСтрока.КоличествоДляТестовогоОтвяза = ТекСтрокаТовары.КоличествоДляТестовогоОтвяза;
			НоваяСтрока.Коэффициент = ТекСтрокаТовары.Коэффициент;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ПоЛотам = ТекСтрокаТовары.ПоЛотам;
			НоваяСтрока.Характеристика = ТекСтрокаТовары.Характеристика;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьТаблицуРезультатыПриемкиПряжиПоКачеству()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктПриемкиПоКачествуТовары.Ссылка.Организация КАК Организация,
		|	АктПриемкиПоКачествуТовары.Ссылка.Контрагент КАК Контрагент,
		|	АктПриемкиПоКачествуТовары.Номенклатура КАК Номенклатура,
		|	АктПриемкиПоКачествуТовары.Характеристика КАК Характеристика,
		|	АктПриемкиПоКачествуКонтрольКачества.Норматив КАК Норматив,
		|	АктПриемкиПоКачествуКонтрольКачества.Факт КАК Факт,
		|	АктПриемкиПоКачествуКонтрольКачества.Отклонение КАК Отклонение,
		|	АктПриемкиПоКачествуОписаниеНедостатков.ОписаниеВыявленныхНедостатковПродукции КАК ОписаниеВыявленныхНедостатковПродукции,
		|	АктПриемкиПоКачествуТовары.Ссылка КАК Регистратор,
		|	ИСТИНА КАК Активность,
		|	АктПриемкиПоКачествуТовары.Ссылка.Дата КАК Период,
		|	АктПриемкиПоКачествуКонтрольКачества.ПунктПроверки КАК ПунктПроверки
		|ИЗ
		|	Документ.КСП_АктПриемкиПоКачеству.Товары КАК АктПриемкиПоКачествуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КСП_АктПриемкиПоКачеству.КонтрольКачества КАК АктПриемкиПоКачествуКонтрольКачества
		|		ПО АктПриемкиПоКачествуТовары.Ссылка = АктПриемкиПоКачествуКонтрольКачества.Ссылка
		|			И АктПриемкиПоКачествуТовары.КлючСтроки = АктПриемкиПоКачествуКонтрольКачества.КлючСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КСП_АктПриемкиПоКачеству.ОписаниеНедостатков КАК АктПриемкиПоКачествуОписаниеНедостатков
		|		ПО АктПриемкиПоКачествуТовары.Ссылка = АктПриемкиПоКачествуОписаниеНедостатков.Ссылка
		|			И АктПриемкиПоКачествуТовары.КлючСтроки = АктПриемкиПоКачествуОписаниеНедостатков.КлючСтроки
		|ГДЕ
		|	АктПриемкиПоКачествуТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НаборДвижений = Движения.КСП_РезультатыПриемкиПряжиПоКачеству;  
	НаборДвижений.мТаблицаДвижений   = ПолучитьТаблицуРезультатыПриемкиПряжиПоКачеству();
	НаборДвижений.ВыполнитьДвижения();
КонецПроцедуры
